<template>
  <div class="analytics">
    <h1 class="analytics__title">Государственный строительный надзор на объектах ФЯО</h1>
    <VAnalytics :analytics="analytics"/>
  </div>
</template>

<script>
const VAnalytics = () => import('@/components/v-analytics')

export default {
  name: 'Analytics_A1',
  components: { VAnalytics },
  data: () => ({
    analytics: {
      title: 'РАЗДЕЛ 1.',
      desc: 'Сведения о количестве проведенных проверок юридических лиц и индивидуальных предпринимателей',
      year: ['2019', '2020'],
      list: [
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XXX',
          color: '#4cd964',
          section: '1.1',
          text: 'Общее количество внеплановых проверок - всего, в том числе по следующим основаниям:'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XX',
          color: '#ffcc00',
          section: '1.1.1',
          text: 'по контролю за исполнением предписаний, выданных по результатам проведенной ранее проверки'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XX',
          color: '#ffcc00',
          section: '1.1.2',
          text: 'по заявлениям (обращениям) физических и юридических лиц, по информации органов государственной власти, местного самоуправления, средств массовой информации об указанных фактах - всего, в том числе:'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XX',
          color: '#0079ff',
          section: '1.1.2.1',
          text: 'о возникновении угрозы причинения вреда жизни, здоровью граждан, вреда животным, растениям, окружающей среде, объектам культурного наследия (памятникам истории и культуры) народов Российской Федерации, безопасности государства, а также угрозы чрезвычайных ситуаций Природного и техногенного характера'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XX',
          color: '#0079ff',
          section: '1.1.2.2',
          text: 'о причинении вреда жизни и здоровью граждан, вреда животным,  растениям, окружающей среде, объектам культурного наследия (памятникам истории и культуры) народов Российской Федерации, имуществу физических и юридических лиц, безопасности государства, а также возникновение чрезвычайных ситуаций природного и техногенного характера'
        },
        {
          x: 'xxx',
          plus: '+x',
          color: '#0079ff',
          circle_text : 'XX',
          section: '1.1.2.3',
          text: 'о нарушении прав потребителей (в случае обращения граждан, права которых нарушены)'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XX',
          color: '#0079ff',
          section: '1.1.2.4',
          text: 'о нарушении трудовых прав граждан'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XX',
          color: '#ffcc00',
          section: '1.1.3',
          text: 'на основании приказов (распоряжений) руководителя органа государственного Контроля (надзора),  изданного в соответствии с поручениями Президента Российской Федерации, Правительства Российской Федерации'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XX',
          color: '#ffcc00',
          section: '1.1.4',
          text: 'на основании приказов (распоряжений) руководителя органа государственного контроля (надзора),  изданного в соответствии с требованием органов прокуратуры'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XX',
          color: '#ffcc00',
          section: '1.1.5',
          text: 'по иным основаниям, установленным законодательством Российской Федерации'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XXX',
          color: '#4cd964',
          section: '1.2',
          text: 'Количество проверок, проведенных совместно с другими органами Государственного контроля (надзора), муниципального контроля'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XX',
          color: '#ffcc00',
          section: '1.2.1',
          text: 'из них внеплановых'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XXX',
          color: '#4cd964',
          section: '1.3',
          text: 'Общее количество документарных проверок'
        },
        {
          x: 'xxx',
          plus: '+x',
          circle_text : 'XXX',
          color: '#4cd964',
          section: '1.4',
          text: 'Общее количество выездных проверок'
        },
      ]
    }
  })
}
</script>

<style scoped>
.analytics {
  padding-bottom: 200px;
}
.analytics__title {
  -webkit-text-stroke: 1px rgba(0, 0, 0, 0);
  font-family: Roboto;
  font-size: 24px;
  font-weight: 300;
  font-stretch: normal;
  font-style: normal;
  line-height: 1.13;
  letter-spacing: normal;
  text-align: left;
  color: red;
  color: var(--dark);
  margin-bottom: 60px;
}
</style>